<template>
    <main>
        <PaperDoc>
            <div class="text-center mt-10">
                <div class="text-xl">
                    <p>สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษจำกัด</p>
                    <p>แบบคำขอปรับโครงสร้างหนี้</p>
                </div>
                <div class="grid grid-cols-2">
                    <div></div>
                    <div class="text-start">
                        เขียนที่ <FiLL :data="data?.location" class="underline underline-offset-4 text-base text-right" no-line />
                        วันที่ <FiLL  class="text-base" :data="data?.dateReceived"date-format="full" no-line />
                    </div>
                    
                </div>
                
                เรียน คณะกรรมการดำเนินการสหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด
                ข้าพเจ้า. .สมาชิกเลขที่.
                ตำแหน่ง... ..เงินเดือน.. ..บาท สังกัด..
                อยู่บ้านเลขที่.. .ถนน. ..ตำบล/แขวง.
                จังหวัด. ..โทรศัพท์.
                ขอเรียนคณะกรรมการฯ ดังนี้
                ข้อ 1. ข้าพเจ้าได้กู้เงินตามหนังสือเงินกู้สามัญ/พิเศษเลขที่..
                เงิน. ..บาท (..
                และดอกเบี้ยงวดรายเดือนทุกเดือนงวดละ ..บาท รวม
                ข้อ 2. ข้าพเจ้าไม่สามารถชำระหนี้ได้ตามสัญญาเนื่องจาก..
                ข้อ 3. ข้าพเจ้าได้แนบเอกสารหลักฐานที่แสดงให้เห็นว่ามีเหตุจำเป็นได้แก่..
                ข้อ 4. ข้าพเจ้าจึงขอปรับโครงสร้างหนี้ดังนี้..
                ..อายุ.
                ..อำเภอ/เขต.
                ..เมื่อวันที่..
                ..งวด
                .ㆍกำหนดชำระต้นเงินกู้
                ..จำนวน
                จึงเรียนมาเพื่อโปรดพิจารณา
                ขอแสงความนับถือ
                สมาชิกเลขที่
            </div>
        </PaperDoc>
    </main>
</template>
<script setup lang="ts">
    const { data } = await useFetch<any>('/api/group2');
</script>