<template>
    <main class="font-sans">
      <PaperDoc>
                        <!-- กู้สามัญทั่วไป general1  -->

        </PaperDoc>
        <PaperDoc>
                        <!-- กู้สามัญทั่วไป general2  -->

        </PaperDoc>
      <MorePaperDoc>
                      <!-- กู้สามัญทั่วไป general3  -->
                      <PaperDoc>
                        <div class="flex flex-col items-end row-span-2">
                <p class="font-bold mb-2">สส.ชสอ. ส.2/1 (สามัญ)</p>
                </div>
              <div class="flex flex-col items-center row-span-2">
                <img class="w-[120px] h-auto"
                  src="https://cypphcoop.com/mediafiles/data/sorsortortor.png"
                  alt="Logo" />
                  <p class="mt-2 font-bold text-base">หนังสือให้ความยินยอมในการหักเงิน และแสดงเจตนาการรับเงินสงเคราะห์</p>
                  <p class="mt-2 font-bold text-base">สมาคมฌาปนกิจสงเคราะห์สหกรณ์สมาชิกของชุมนุมสหกรณ์ออมทรัพย์แห่งประเทศไทย (สส.ชสอ.)</p>
              </div>
              <div class="grid justify-items mt-8">
<p class=" text-base pl-96 ml-16">เขียนที่ ................................................. &nbsp;</p>
<p class=" text-base pl-96 ml-16" >วันที่ ................................................. </p><br>
            </div>
            <div class="grid justify-items-start text-pretty text-base  ">
            <p><span class="ml-20">1. ข้าพเจ้า</span>
              ................................................. อายุ ....................... ปี เกิดวันที่ ................ เดือน...................... พศ.....................
              สมาชิกสหกรณ์ออมทรัพย์ ................................................. เลขทะเบียนสมาชิก................. 
              ปัจจุบันอยู่บ้านเลขที่ .................... หมู่ที่ .................... ถนน .................... ตำบล ....................
          อำเภอ .................... จังหวัด .................... รหัสไปรษณีย์ .................... เบอร์โทรศัพท์ ....................
              ทำงานประจำในตำแหน่ง.................... สถานที่ทำงาน.................... ตำบล/แขวง ....................
          อำเภอ/เขต .................... จังหวัด .................... รหัสไปรษณีย์ .................... โทรศัพท์ที่ทำงาน ....................
            </p>
            <p> <span class="ml-20"></span>2. หากข้าพเจ้าถึงแก่ความตาย ข้าพเจ้าขอมอบสิทธิให้....................
              เลขประจำตัวประชาชน.................... เกี่ยวข้องเป็น.................... เป็นผู้จัดการศพของข้าพเจ้า
      </p>
      <p> <span class="ml-20"></span>3. ข้าพเจ้าขอแสดงเจตนารับการเงินสงเคราะห์ที่ สส.ขสอ. พึงจ่าย หลังจากจ่ายค่าจัดงานศพให้บุคคลที่ระบุไว้และ
        ยินยอมให้สหกรณ์ออมทรัพย์ฯ....................จำกัด หักเงินชำระหนี้ให้เสร็จสิ้น
        เท่ากับจำนวนหนี้สินที่ข้าพเจ้าผูกพันอยู่ในขณะนั้นเป็นอันดับแรก (ถ้ามี) ส่วนที่เหลือขอมอบให้บุคคลดังต่อไปนี้
      </p>
            </div>
<div class="flex flex-col ml-10 text-start "no-line>
        <LineFiLL :data="data?.repaymentPlan"
          :limit="5">
          <template #data="{ index, item }">
            <p class=" text-base pl-8"></p>
            <p class="text-start text-base"><span class="ml-20">3 </span>
              <FiLL :data="index"
                number
                normal no-line/>.
                ชื่อ 
              ................................................................................. เลขประจำตัวประชาชน....................................<br>
            ตำแหน่ง........................................................................................<br>
             เบอร์โทรศัพท์.......................................................................................เกี่ยวข้องเป็น.....................................................
            </p>
          </template>
          <template #default="{ index }">
            <p class="text-start text-base"><span class="ml-20">3 </span>
              <FiLL :data="index"
                number
                normal no-line/>.
                ชื่อ 
              ................................................................................. เลขประจำตัวประชาชน....................................<br>
            ตำแหน่ง........................................................................................<br>
             เบอร์โทรศัพท์.......................................................................................เกี่ยวข้องเป็น.....................................................
            </p>

          </template>
        </LineFiLL>
        </div>
        <p> <span class="ml-20 font-bold">อนึ่งข้าพเจ้าขอรับรองว่า การแสดงเจตาครั้งนี้เป็นไปด้วยความสมุครใจ ไม่มีผู้ใดบังคับ ข่มขู่ หรือกระทำการ
              ใดๆ ให้ข้าพเจ้าแสดงเจตนาดังกล่าว จึงได้ลงมือไว้เป็นสำคัญ ท้ายหนังสือนี้</span></p>
              <p class="mt-2">(ลงชื่อ)............................................................ผู้ให้คำยินยอม
                <span class="ml-4"> (ลงชื่อ)............................................................พยาน </span></p>
              <p class="mt-2">(ลงชื่อ)............................................................ผู้จัดการ/จนท.ศูนย์ฯ
                <span class="ml-4"> (ลงชื่อ)............................................................ประธาน ศูนย์ฯ </span>
              </p>
              <br>
        </PaperDoc>
      </MorePaperDoc>
    </main>
  </template>
  
  <script setup
  lang="ts">

  const { data } = await useFetch<any>('/api/group2');
</script>