<template>
    <main>
      <PaperDoc>
        <div class="flex flex-col">
        <p class="text-start ml-8">หักเงินเดือน ค่าจ้าง หรือเงินบำนาญหรือเงินบำเหน็จ หรือเงินอื่นใดในลักษณะเดียวกันที่ข้าพเจ้ามีสิทธิจะได้รับ</p>
        <p class="text-start ml-8">จากทางราชการ หน่วยงานของรัฐ หรือองค์กรปกครองส่วนท้องถิ่น แล้วแต่กรณี เพื่อส่งชำระหนี้ ชำระค่าหุ้น</p>
        <p class="text-start ml-8">หรือเงินอื่น ให้สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด แทนข้าพเจ้าได้ทุกเดือน</p>
        <p class="text-start ml-8">และข้าพเจ้าสัญญาว่าจะถือปฏิบัติตามคำยินยอมในหนังสือฉบับนี้ทุกประการ เพียงแต่สหกรณ์ได้มีหนังสือแจ้ง</p>
        <p class="text-start ml-8">ให้ส่วนราชการ หรือให้หน่วยงานของรัฐ หรือองค์กรปกครองส่วนท้องถิ่นที่ข้าพเจ้าสังกัดอยู่เพื่อดำเนินการ</p>
        <p class="text-start ml-8">ดังกล่าวข้างต้นแทนข้าพเจ้าก็เป็นการเพียงพอแล้ว</p>
        <p class="indent-20 text-start ml-10">หนังสือยินยอมฉบับนี้ทำขึ้นโดยความสมัครใจของข้าพเจ้าเอง ได้ตรวจสอบข้อความและ</p>
        <p class="text-start ml-8">ถ้อยคำในหนังสือนี้ทั้งหมดแล้ว ตรงตามเจตนารมณ์ของข้าพเจ้าทุกประการ จึงลงลายมือชื่อไว้เป็นสำคัญ</p>
        <p class="text-start ml-8">ดังกล่าวข้างต้นแทนข้าพเจ้าก็เป็นการเพียงพอแล้ว</p>
        <p class="indent-20 text-start ml-10">หนังสือนี้ทำขึ้น 3 ฉบับ มีข้อความตรงกัน ฉบับที่หนึ่งเก็บไว้ที่โรงพยาบาลศรีสะเกษ</p>
        <p class="text-start ml-8">ฉบับที่สองเก็บไว้ที่ข้าพเจ้า และฉบับที่สามให้ไว้กับสหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</p>
        </div>
  
        <p class="mt-14 ml-40">
                <span class="ml-14">
                    ลงชื่อ......................................................................ผู้ให้คำยินยอม (ผู้สมัคร)
                </span>
            </p>
            <p class="mb-5 text-center">(..................................................................)</p>

            <p class="mt-14 ml-40">
                <span class="ml-14">
                    ลงชื่อ....................................................................พยาน(สมาชิก)
                </span>
            </p>
            <p class="mb-6 text-center">(..................................................................)</p>

            <p class="mt-14 ml-40">
                <span class="ml-14">
                    ลงชื่อ....................................................................พยาน(สมาชิก)
                </span>
            </p>
            <p class="mb-6 text-center">(..................................................................)</p>


      </PaperDoc>
    </main>
  </template>